[
  {
    "id": "aws-001",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Sob o Modelo de Responsabilidade Compartilhada da AWS, qual das seguintes é uma responsabilidade do CLIENTE?",
    "options": [
      {
        "id": "a",
        "text": "Gerenciamento de patches do software de infraestrutura (hypervisor)."
      },
      {
        "id": "b",
        "text": "Segurança física dos data centers."
      },
      {
        "id": "c",
        "text": "Configuração de grupos de segurança (Security Groups) e firewalls de rede."
      },
      {
        "id": "d",
        "text": "Descarte físico de dispositivos de armazenamento."
      }
    ],
    "correctOptionId": "c",
    "explanation": "O cliente é responsável pela segurança 'na' nuvem, o que inclui configurar grupos de segurança, gerenciar dados e patches do sistema operacional convidado."
  },
  {
    "id": "aws-002",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Uma empresa deseja armazenar dados com padrões de acesso desconhecidos ou alterados. Qual classe de armazenamento do Amazon S3 deve ser usada para otimizar custos automaticamente?",
    "options": [
      {
        "id": "a",
        "text": "S3 Standard: Para dados acessados com frequência."
      },
      {
        "id": "b",
        "text": "S3 Intelligent-Tiering: Move objetos automaticamente entre níveis de acesso frequente e infrequente."
      },
      {
        "id": "c",
        "text": "S3 Glacier: Para arquivamento de longo prazo."
      },
      {
        "id": "d",
        "text": "S3 One Zone-IA: Para dados acessados com pouca frequência em uma única zona."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O S3 Intelligent-Tiering é a única classe que monitora padrões de acesso e move objetos entre diretórios de custo otimizado sem intervenção manual."
  },
  {
    "id": "aws-003",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "Qual serviço permite que uma empresa execute contêineres Docker sem precisar gerenciar ou escalar servidores EC2?",
    "options": [
      {
        "id": "a",
        "text": "Amazon EC2: Exige gerenciamento de instâncias."
      },
      {
        "id": "b",
        "text": "AWS Fargate: Motor de computação serverless para contêineres."
      },
      {
        "id": "c",
        "text": "Amazon Lightsail: Servidores virtuais simplificados."
      },
      {
        "id": "d",
        "text": "AWS Batch: Para execução de jobs em lote."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O AWS Fargate permite executar contêineres sem gerenciar a infraestrutura subjacente, funcionando com o ECS ou EKS."
  },
  {
    "id": "aws-004",
    "certification": "CLF-C02",
    "topicId": "BILLING_TOOLS",
    "text": "Qual ferramenta da AWS fornece previsões de custos e permite definir alertas quando os gastos excedem um limite especificado?",
    "options": [
      {
        "id": "a",
        "text": "AWS Cost Explorer: Visualiza custos históricos e tendências."
      },
      {
        "id": "b",
        "text": "AWS Budgets: Define orçamentos personalizados e envia alertas de gastos."
      },
      {
        "id": "c",
        "text": "AWS Trusted Advisor: Dá recomendações de otimização."
      },
      {
        "id": "d",
        "text": "AWS Pricing Calculator: Estima custos antes de usar os serviços."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O AWS Budgets é focado em definir limites e alertar o usuário, enquanto o Cost Explorer é mais para análise e visualização."
  },
  {
    "id": "aws-005",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual pilar do AWS Well-Architected Framework foca na capacidade de um sistema se recuperar de interrupções de serviço ou infraestrutura?",
    "options": [
      {
        "id": "a",
        "text": "Eficiência de Performance: Foca em usar recursos computacionais de forma eficiente."
      },
      {
        "id": "b",
        "text": "Confiabilidade (Reliability): Foca na recuperação e continuidade operacional."
      },
      {
        "id": "c",
        "text": "Excelência Operacional: Foca em rodar e monitorar sistemas."
      },
      {
        "id": "d",
        "text": "Otimização de Custos: Foca em evitar gastos desnecessários."
      }
    ],
    "correctOptionId": "b",
    "explanation": "A Confiabilidade garante que o sistema suporte falhas e se recupere automaticamente para atender à demanda."
  },
  {
    "id": "aws-006",
    "certification": "CLF-C02",
    "topicId": "RDS",
    "text": "Qual serviço de banco de dados da AWS é NoSQL, totalmente gerenciado e oferece performance de milissegundos em qualquer escala?",
    "options": [
      {
        "id": "a",
        "text": "Amazon RDS: Banco de dados relacional (SQL)."
      },
      {
        "id": "b",
        "text": "Amazon DynamoDB: Banco de dados de chave-valor e documentos (NoSQL)."
      },
      {
        "id": "c",
        "text": "Amazon Redshift: Data warehouse para analytics."
      },
      {
        "id": "d",
        "text": "Amazon Aurora: Banco relacional compatível com MySQL/PostgreSQL."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O DynamoDB é o serviço NoSQL principal da AWS, conhecido por sua escalabilidade e baixa latência."
  },
  {
    "id": "aws-007",
    "certification": "CLF-C02",
    "topicId": "VPC",
    "text": "Qual componente da rede AWS atua como um firewall para controlar o tráfego de entrada e saída no nível da INSTÂNCIA?",
    "options": [
      {
        "id": "a",
        "text": "Network ACL (NACL): Firewall no nível da sub-rede (stateless)."
      },
      {
        "id": "b",
        "text": "Security Group: Firewall no nível da instância (stateful)."
      },
      {
        "id": "c",
        "text": "Internet Gateway: Permite comunicação entre a VPC e a internet."
      },
      {
        "id": "d",
        "text": "VPC Peering: Conecta duas VPCs."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Security Groups são aplicados diretamente às instâncias (ENIs) e são stateful, ao contrário das NACLs que operam na sub-rede."
  },
  {
    "id": "aws-008",
    "certification": "CLF-C02",
    "topicId": "IAM",
    "text": "Qual prática recomendada de segurança deve ser aplicada para garantir que usuários tenham apenas as permissões necessárias para realizar suas tarefas?",
    "options": [
      {
        "id": "a",
        "text": "Uso da conta Root para tarefas diárias: Não recomendado por ser inseguro."
      },
      {
        "id": "b",
        "text": "Princípio do Menor Privilégio (Least Privilege): Conceder apenas o mínimo de acesso necessário."
      },
      {
        "id": "c",
        "text": "Compartilhamento de chaves de acesso: Prática insegura."
      },
      {
        "id": "d",
        "text": "Desativação do MFA para administradores: Prática insegura."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Princípio do Menor Privilégio é fundamental para reduzir o raio de alcance de possíveis incidentes de segurança."
  },
  {
    "id": "aws-009",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "Uma empresa deseja migrar um servidor web local para a AWS. Qual serviço de computação fornece instâncias virtuais que dão controle total sobre o sistema operacional?",
    "options": [
      {
        "id": "a",
        "text": "AWS Lambda: Serverless, sem controle de SO."
      },
      {
        "id": "b",
        "text": "Amazon EC2: Fornece máquinas virtuais com controle total."
      },
      {
        "id": "c",
        "text": "AWS Elastic Beanstalk: PaaS para deploy de aplicações."
      },
      {
        "id": "d",
        "text": "Amazon Lightsail: Instâncias virtuais pré-configuradas e simplificadas."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O EC2 (Elastic Compute Cloud) é o serviço de IaaS que oferece o nível mais granular de controle sobre a infraestrutura."
  },
  {
    "id": "aws-010",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Qual serviço de armazenamento é ideal para ser usado como um sistema de arquivos compartilhado, acessível por milhares de instâncias EC2 simultaneamente?",
    "options": [
      {
        "id": "a",
        "text": "Amazon EBS: Bloqueio de armazenamento para uma única instância (geralmente)."
      },
      {
        "id": "b",
        "text": "Amazon EFS: Sistema de arquivos elástico e compartilhado via rede (NFS)."
      },
      {
        "id": "c",
        "text": "Amazon S3: Armazenamento de objetos, não um sistema de arquivos tradicional."
      },
      {
        "id": "d",
        "text": "Amazon Instance Store: Armazenamento temporário fisicamente ligado ao host."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O EFS (Elastic File System) é projetado para suportar acesso compartilhado de milhares de instâncias usando o protocolo NFS."
  },
  {
    "id": "aws-011",
    "certification": "CLF-C02",
    "topicId": "BILLING_TOOLS",
    "text": "Qual plano de suporte da AWS inclui o acesso a um Technical Account Manager (TAM) dedicado?",
    "options": [
      {
        "id": "a",
        "text": "Developer Support: Focado em testes e desenvolvimento."
      },
      {
        "id": "b",
        "text": "Business Support: Focado em cargas de trabalho de produção."
      },
      {
        "id": "c",
        "text": "Enterprise Support: O nível mais alto, inclui TAM e concierges."
      },
      {
        "id": "d",
        "text": "Basic Support: Incluído para todos os clientes, sem TAM."
      }
    ],
    "correctOptionId": "c",
    "explanation": "O TAM está disponível apenas no nível Enterprise, oferecendo orientação técnica e operacional personalizada."
  },
  {
    "id": "aws-012",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual serviço da AWS ajuda a automatizar a governança em ambientes multiplex (com centenas de contas), permitindo controle centralizado e faturamento consolidado?",
    "options": [
      {
        "id": "a",
        "text": "AWS CloudTrail: Logs de API."
      },
      {
        "id": "b",
        "text": "AWS Organizations: Gerenciamento centralizado de múltiplas contas AWS."
      },
      {
        "id": "c",
        "text": "AWS Config: Monitora configurações de recursos."
      },
      {
        "id": "d",
        "text": "AWS Systems Manager: Gerenciamento operacional de instâncias."
      }
    ],
    "correctOptionId": "b",
    "explanation": "AWS Organizations permite agrupar contas em UOs (Unidades Organizacionais), aplicar políticas (SCPs) e consolidar o faturamento."
  },
  {
    "id": "aws-013",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Qual serviço AWS é usado para detectar atividades maliciosas ou comportamento não autorizado, protegendo contas e cargas de trabalho usando machine learning?",
    "options": [
      {
        "id": "a",
        "text": "Amazon Inspector: Varredura de vulnerabilidades em instâncias EC2."
      },
      {
        "id": "b",
        "text": "Amazon GuardDuty: Serviço de detecção de ameaças inteligente e contínuo."
      },
      {
        "id": "c",
        "text": "AWS WAF: Firewall de aplicação web contra exploits comuns."
      },
      {
        "id": "d",
        "text": "AWS Shield: Proteção contra ataques DDoS."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O GuardDuty analisa logs (VPC Flow Logs, CloudTrail, DNS) para identificar comportamentos suspeitos como mineração de cripto ou exfiltração de dados."
  },
  {
    "id": "aws-014",
    "certification": "CLF-C02",
    "topicId": "VPC",
    "text": "Qual serviço de DNS da AWS é altamente disponível, escalável e capaz de rotear usuários para endpoints baseados em políticas como geocalização e latência?",
    "options": [
      {
        "id": "a",
        "text": "Amazon CloudFront: Rede de entrega de conteúdo (CDN)."
      },
      {
        "id": "b",
        "text": "Amazon Route 53: Serviço de DNS autoritativo e registro de domínios."
      },
      {
        "id": "c",
        "text": "AWS Global Accelerator: Otimiza caminhos de rede usando a infraestrutura global da AWS."
      },
      {
        "id": "d",
        "text": "VPC PrivateLink: Conecta serviços de forma privada."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Route 53 é o serviço de DNS da AWS que oferece roteamento avançado para melhorar a experiência do usuário global."
  },
  {
    "id": "aws-015",
    "certification": "CLF-C02",
    "topicId": "RDS",
    "text": "Uma empresa precisa de um banco de dados relacional que scale automaticamente a capacidade de processamento conforme a demanda (serverless). Qual opção é a mais adequada?",
    "options": [
      {
        "id": "a",
        "text": "Amazon RDS (Instância Fixa): Requer escolha de tamanho de instância."
      },
      {
        "id": "b",
        "text": "Amazon Aurora Serverless: Escala automaticamente a capacidade de computação."
      },
      {
        "id": "c",
        "text": "Amazon Redshift: Focado em OLAP/Analytics, não transacional dinâmico."
      },
      {
        "id": "d",
        "text": "Amazon ElastiCache: Cache em memória."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Aurora Serverless é ideal para aplicações com tráfego variável, pois ajusta os recursos de CPU e memória sem intervenção manual."
  },
  {
    "id": "aws-016",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "Qual benefício da nuvem AWS se refere à capacidade de pagar apenas pelo que você usa, sem investimentos iniciais pesados (CapEx)?",
    "options": [
      {
        "id": "a",
        "text": "Agilidade: Velocidade para lançar recursos."
      },
      {
        "id": "b",
        "text": "Trocar Despesas de Capital (CapEx) por Despesas Operacionais (OpEx)."
      },
      {
        "id": "c",
        "text": "Economias de Escala: Custos menores devido ao grande volume de clientes."
      },
      {
        "id": "d",
        "text": "Alcance Global: Lançar aplicações em minutos em todo o mundo."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Um dos 6 benefícios da computação em nuvem é a mudança do modelo de investimento inicial por um modelo de pagamento conforme o uso."
  },
  {
    "id": "aws-017",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Qual serviço AWS permite gerar, armazenar e gerenciar chaves criptográficas usadas para proteger seus dados?",
    "options": [
      {
        "id": "a",
        "text": "AWS Secrets Manager: Focado em senhas e segredos de aplicações."
      },
      {
        "id": "b",
        "text": "AWS Key Management Service (KMS): Gerenciamento centralizado de chaves de criptografia."
      },
      {
        "id": "c",
        "text": "AWS Certificate Manager (ACM): Gerencia certificados SSL/TLS."
      },
      {
        "id": "d",
        "text": "Amazon Macie: Descobre dados sensíveis no S3."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O KMS é o serviço que cria e controla chaves mestras (KMS keys) usadas para criptografar dados em diversos serviços AWS."
  },
  {
    "id": "aws-018",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Qual serviço de armazenamento fornece baixa latência e alta taxa de transferência para dados que precisam ser acessados como se estivessem em um disco local ligado à instância EC2?",
    "options": [
      {
        "id": "a",
        "text": "Amazon S3: Armazenamento via API (HTTPS)."
      },
      {
        "id": "b",
        "text": "Amazon Elastic Block Store (EBS): Volumes de bloco para uso com instâncias EC2."
      },
      {
        "id": "c",
        "text": "AWS Snowball: Dispositivo físico para transporte de dados."
      },
      {
        "id": "d",
        "text": "Amazon Glacier: Armazenamento de arquivamento."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O EBS fornece armazenamento de bloco (como um HD ou SSD) que é montado diretamente nas instâncias EC2 para performance e persistência."
  },
  {
    "id": "aws-019",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual ferramenta fornece recomendações em tempo real para ajudar a seguir as melhores práticas da AWS em categorias como Segurança, Otimização de Custos e Tolerância a Falhas?",
    "options": [
      {
        "id": "a",
        "text": "AWS Config: Histórico de configurações."
      },
      {
        "id": "b",
        "text": "AWS Trusted Advisor: Consultor automatizado de melhores práticas."
      },
      {
        "id": "c",
        "text": "AWS CloudTrail: Monitoramento de chamadas de API."
      },
      {
        "id": "d",
        "text": "AWS Health Dashboard: Status técnico dos serviços AWS."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Trusted Advisor verifica seu ambiente e sugere melhorias baseadas nas melhores práticas da AWS em 5 categorias essenciais."
  },
  {
    "id": "aws-020",
    "certification": "CLF-C02",
    "topicId": "BILLING_TOOLS",
    "text": "Qual modelo de compra de instâncias EC2 oferece o maior desconto (até 90%) para cargas de trabalho que podem ser interrompidas subitamente?",
    "options": [
      {
        "id": "a",
        "text": "On-Demand: Preço fixo por segundo, sem compromisso."
      },
      {
        "id": "b",
        "text": "Reserved Instances (RIs): Compromisso de 1 a 3 anos."
      },
      {
        "id": "c",
        "text": "Spot Instances: Aproveita capacidade ociosa da AWS a preços baixos."
      },
      {
        "id": "d",
        "text": "Savings Plans: Compromisso de gasto em $ por hora."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Instâncias Spot são as mais baratas, ideais para processamento flexível onde a continuidade não é crítica, pois a AWS pode retirá-las com aviso prévio."
  },
  {
    "id": "aws-021",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Qual serviço da AWS permite que usuários façam login em aplicações web usando suas identidades sociais (Google, Facebook) ou corporativas?",
    "options": [
      {
        "id": "a",
        "text": "AWS IAM: Gerenciamento interno de usuários da conta AWS."
      },
      {
        "id": "b",
        "text": "Amazon Cognito: Identidade para aplicações web e móveis."
      },
      {
        "id": "c",
        "text": "AWS Single Sign-On (IAM Identity Center): Acesso centralizado a múltiplas contas."
      },
      {
        "id": "d",
        "text": "AWS Directory Service: Conecta a AWS com o Microsoft Active Directory."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Amazon Cognito fornece pools de usuários e de identidade para autenticação externa e gerenciamento de acesso em apps."
  },
  {
    "id": "aws-022",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "Qual serviço simplifica a criação, manutenção e distribuição de imagens de máquinas (AMIs) e imagens de contêiner ou máquinas virtuais?",
    "options": [
      {
        "id": "a",
        "text": "AWS Elastic Beanstalk."
      },
      {
        "id": "b",
        "text": "EC2 Image Builder: Automatiza a criação de imagens douradas (gold images)."
      },
      {
        "id": "c",
        "text": "AWS CloudFormation: Infraestrutura como código."
      },
      {
        "id": "d",
        "text": "Amazon ECR: Registro de contêineres."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O EC2 Image Builder reduz o esforço manual de manter imagens atualizadas com patches e agentes."
  },
  {
    "id": "aws-023",
    "certification": "CLF-C02",
    "topicId": "VPC",
    "text": "Qual serviço fornece uma conexão de rede PRIVADA e DEDICADA entre o data center on-premises de uma empresa e a nuvem AWS, ignorando a internet pública?",
    "options": [
      {
        "id": "a",
        "text": "AWS Site-to-Site VPN: Conexão criptografada via internet."
      },
      {
        "id": "b",
        "text": "AWS Direct Connect: Link físico dedicado de baixa latência e performance consistente."
      },
      {
        "id": "c",
        "text": "AWS Client VPN: Acesso remoto para usuários individuais."
      },
      {
        "id": "d",
        "text": "Amazon Route 53 Resolver."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Direct Connect oferece uma conexão física direta para a AWS, fornecendo segurança superior e largura de banda estável comparado à VPN."
  },
  {
    "id": "aws-024",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Qual serviço da AWS é uma ferramenta de transferência de dados online que simplifica, automatiza e acelera a movimentação de TBs de dados de fontes on-premises para o S3, EFS ou FSx?",
    "options": [
      {
        "id": "a",
        "text": "AWS Snowball: Transferência física via hardware."
      },
      {
        "id": "b",
        "text": "AWS DataSync: Serviço de transferência online via rede."
      },
      {
        "id": "c",
        "text": "AWS Storage Gateway: Conecta armazenamento local à nuvem."
      },
      {
        "id": "d",
        "text": "Amazon S3 Transfer Acceleration: Otimiza uploads via CloudFront."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O DataSync é focado em automatizar a cronometragem e execução de transferências de grandes volumes de dados via rede."
  },
  {
    "id": "aws-025",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual serviço permite gerenciar infraestrutura como código (IaC), usando arquivos JSON ou YAML para modelar e provisionar recursos AWS de forma repetível?",
    "options": [
      {
        "id": "a",
        "text": "AWS OpsWorks: Baseado em Chef e Puppet."
      },
      {
        "id": "b",
        "text": "AWS CloudFormation: Serviço nativo de provisionamento via templates."
      },
      {
        "id": "c",
        "text": "AWS Systems Manager: Gerenciamento de patches e automação operacional."
      },
      {
        "id": "d",
        "text": "AWS CodeDeploy: Automatiza deploy de código."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O CloudFormation permite definir toda a sua arquitetura em um arquivo de texto, tornando a infraestrutura versionável e fácil de replicar."
  },
  {
    "id": "aws-026",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Qual política de controle da AWS garante que os dados em repouso no Amazon S3 sejam protegidos contra acesso não autorizado?",
    "options": [
      {
        "id": "a",
        "text": "Políticas de bucket do S3 (Bucket Policies)."
      },
      {
        "id": "b",
        "text": "Ativar versionamento no bucket."
      },
      {
        "id": "c",
        "text": "Uso de chaves de criptografia (Server-Side Encryption)."
      },
      {
        "id": "d",
        "text": "Monitoramento por CloudWatch."
      }
    ],
    "correctOptionId": "c",
    "explanation": "A criptografia em repouso garante que, mesmo que os dados sejam fisicamente acessados, eles permaneçam ilegíveis sem as chaves corretas."
  },
  {
    "id": "aws-027",
    "certification": "CLF-C02",
    "topicId": "CLOUD_BENEFITS",
    "text": "O que a AWS define como a capacidade de aumentar ou diminuir a capacidade computacional em resposta à demanda em tempo real?",
    "options": [
      {
        "id": "a",
        "text": "Escalabilidade: Expandir para atender picos de carga."
      },
      {
        "id": "b",
        "text": "Elasticidade: Aumentar e diminuir recursos dinamicamente."
      },
      {
        "id": "c",
        "text": "Alta Disponibilidade: Garantir que o sistema nunca pare."
      },
      {
        "id": "d",
        "text": "Tolerância a Falhas: Continuar operando em caso de erro."
      }
    ],
    "correctOptionId": "b",
    "explanation": "A elasticidade é o conceito chave da nuvem que permite otimizar custos ao remover recursos ociosos e adicionar novos quando necessário."
  },
  {
    "id": "aws-028",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual serviço permite visualizar logs de auditoria detalhados de TODAS as ações realizadas via Console da AWS, APIs ou CLI?",
    "options": [
      {
        "id": "a",
        "text": "Amazon CloudWatch: Logs de aplicação e métricas de performance."
      },
      {
        "id": "b",
        "text": "AWS CloudTrail: Registra as chamadas de API feitas na conta."
      },
      {
        "id": "c",
        "text": "AWS Trusted Advisor: Recomendações de melhores práticas."
      },
      {
        "id": "d",
        "text": "AWS Config: Histórico de configurações de recursos."
      }
    ],
    "correctOptionId": "b",
    "explanation": "CloudTrail é essencial para governança, conformidade e auditoria de segurança, rastreando 'quem fez o quê'."
  },
  {
    "id": "aws-029",
    "certification": "CLF-C02",
    "topicId": "VPC",
    "text": "Qual serviço de borda (edge) da AWS melhora a performance de entrega de conteúdo estático e dinâmico (como vídeos e imagens) usando uma rede global de pontos de presença?",
    "options": [
      {
        "id": "a",
        "text": "Amazon S3: Onde os arquivos são armazenados originalmente."
      },
      {
        "id": "b",
        "text": "Amazon CloudFront: Rede de Entrega de Conteúdo (CDN)."
      },
      {
        "id": "c",
        "text": "ELB (Elastic Load Balancer): Distribui tráfego entre instâncias."
      },
      {
        "id": "d",
        "text": "AWS Transit Gateway: Conecta VPCs e redes locais."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O CloudFront faz cache do conteúdo em locais próximos aos usuários, reduzindo a latência consideravelmente."
  },
  {
    "id": "aws-030",
    "certification": "CLF-C02",
    "topicId": "BILLING_TOOLS",
    "text": "Qual ferramenta permite estimar o custo mensal da sua arquitetura antes de provisionar qualquer recurso na nuvem?",
    "options": [
      {
        "id": "a",
        "text": "AWS Cost Explorer."
      },
      {
        "id": "b",
        "text": "AWS Pricing Calculator: Permite simular custos de serviços individuais e arquiteturas."
      },
      {
        "id": "c",
        "text": "AWS Billing Dashboard."
      },
      {
        "id": "d",
        "text": "AWS Budgets."
      }
    ],
    "correctOptionId": "b",
    "explanation": "A Pricing Calculator é usada na fase de planejamento para entender o impacto financeiro de uma solução."
  },
  {
    "id": "aws-031",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "O AWS Lambda é um exemplo de qual modelo de serviço de computação?",
    "options": [
      {
        "id": "a",
        "text": "IaaS (Infrastructure as a Service)."
      },
      {
        "id": "b",
        "text": "PaaS (Platform as a Service)."
      },
      {
        "id": "c",
        "text": "FaaS (Function as a Service) ou Serverless."
      },
      {
        "id": "d",
        "text": "SaaS (Software as a Service)."
      }
    ],
    "correctOptionId": "c",
    "explanation": "Lambda permite rodar funções individuais sem se preocupar com a plataforma web ou infraestrutura de servidor."
  },
  {
    "id": "aws-032",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Qual serviço AWS protege contra ataques de negação de serviço (DDoS) nas camadas 3 e 4, incluído gratuitamente para todos os clientes?",
    "options": [
      {
        "id": "a",
        "text": "AWS WAF."
      },
      {
        "id": "b",
        "text": "AWS Shield Standard: Proteção básica contra DDoS automática e gratuita."
      },
      {
        "id": "c",
        "text": "AWS Shield Advanced: Proteção paga com suporte especializado 24/7."
      },
      {
        "id": "d",
        "text": "AWS Firewall Manager."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Shield Standard protege todos os clientes contra os tipos mais comuns de ataques de infraestrutura sem custo adicional."
  },
  {
    "id": "aws-033",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Qual serviço de armazenamento é baseado localmente e NÃO persiste dados se a instância EC2 for interrompida ou encerrada?",
    "options": [
      {
        "id": "a",
        "text": "Amazon EBS."
      },
      {
        "id": "b",
        "text": "Amazon Instance Store: Armazenamento efêmero ligado fisicamente ao host."
      },
      {
        "id": "c",
        "text": "Amazon EFS."
      },
      {
        "id": "d",
        "text": "AWS Snowmobile."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Instance Store é ideal para cache ou dados temporários que não precisam de persistência, pois os dados são perdidos ao parar a instância."
  },
  {
    "id": "aws-034",
    "certification": "CLF-C02",
    "topicId": "RDS",
    "text": "Qual serviço AWS permite acelerar a performance de bancos de dados relacionais armazenando em memória os resultados de queries frequentes?",
    "options": [
      {
        "id": "a",
        "text": "Amazon DynamoDB DAX: Cache específico para DynamoDB."
      },
      {
        "id": "b",
        "text": "Amazon ElastiCache: Cache gerenciado (Redis ou Memcached) para bancos como RDS."
      },
      {
        "id": "c",
        "text": "AWS DMS: Serviço de migração de banco de dados."
      },
      {
        "id": "d",
        "text": "Amazon Neptune: Banco de dados de grafos."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O ElastiCache melhora o tempo de resposta das aplicações descarregando queries repetitivas do banco de dados principal."
  },
  {
    "id": "aws-035",
    "certification": "CLF-C02",
    "topicId": "CLOUD_BENEFITS",
    "text": "Qual serviço AWS fornece recomendações para otimizar a infraestrutura, focado em 5 categorias: custo, performance, segurança, tolerância a falhas e limites de serviço?",
    "options": [
      {
        "id": "a",
        "text": "AWS Config."
      },
      {
        "id": "b",
        "text": "AWS Trusted Advisor."
      },
      {
        "id": "c",
        "text": "AWS CloudTrail."
      },
      {
        "id": "d",
        "text": "Amazon Inspector."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Trusted Advisor é como um check-up regular da sua conta para garantir que você está usando a AWS com eficiência máxima."
  },
  {
    "id": "aws-036",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Sob o Modelo de Responsabilidade Compartilhada da AWS, qual das seguintes é uma responsabilidade do CLIENTE?",
    "options": [
      {
        "id": "a",
        "text": "Gerenciamento de patches do software de infraestrutura (hypervisor)."
      },
      {
        "id": "b",
        "text": "Segurança física dos data centers."
      },
      {
        "id": "c",
        "text": "Configuração de grupos de segurança (Security Groups) e firewalls de rede."
      },
      {
        "id": "d",
        "text": "Descarte físico de dispositivos de armazenamento."
      }
    ],
    "correctOptionId": "c",
    "explanation": "O cliente é responsável pela segurança 'na' nuvem, o que inclui configurar grupos de segurança, gerenciar dados e patches do sistema operacional convidado."
  },
  {
    "id": "aws-037",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Uma empresa deseja armazenar dados com padrões de acesso desconhecidos ou alterados. Qual classe de armazenamento do Amazon S3 deve ser usada para otimizar custos automaticamente?",
    "options": [
      {
        "id": "a",
        "text": "S3 Standard: Para dados acessados com frequência."
      },
      {
        "id": "b",
        "text": "S3 Intelligent-Tiering: Move objetos automaticamente entre níveis de acesso frequente e infrequente."
      },
      {
        "id": "c",
        "text": "S3 Glacier: Para arquivamento de longo prazo."
      },
      {
        "id": "d",
        "text": "S3 One Zone-IA: Para dados acessados com pouca frequência em uma única zona."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O S3 Intelligent-Tiering é a única classe que monitora padrões de acesso e move objetos entre diretórios de custo otimizado sem intervenção manual."
  },
  {
    "id": "aws-038",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "Qual serviço permite que uma empresa execute contêineres Docker sem precisar gerenciar ou escalar servidores EC2?",
    "options": [
      {
        "id": "a",
        "text": "Amazon EC2: Exige gerenciamento de instâncias."
      },
      {
        "id": "b",
        "text": "AWS Fargate: Motor de computação serverless para contêineres."
      },
      {
        "id": "c",
        "text": "Amazon Lightsail: Servidores virtuais simplificados."
      },
      {
        "id": "d",
        "text": "AWS Batch: Para execução de jobs em lote."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O AWS Fargate permite executar contêineres sem gerenciar a infraestrutura subjacente, funcionando com o ECS ou EKS."
  },
  {
    "id": "aws-039",
    "certification": "CLF-C02",
    "topicId": "BILLING_TOOLS",
    "text": "Qual ferramenta da AWS fornece previsões de custos e permite definir alertas quando os gastos excedem um limite especificado?",
    "options": [
      {
        "id": "a",
        "text": "AWS Cost Explorer: Visualiza custos históricos e tendências."
      },
      {
        "id": "b",
        "text": "AWS Budgets: Define orçamentos personalizados e envia alertas de gastos."
      },
      {
        "id": "c",
        "text": "AWS Trusted Advisor: Dá recomendações de otimização."
      },
      {
        "id": "d",
        "text": "AWS Pricing Calculator: Estima custos antes de usar os serviços."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O AWS Budgets é focado em definir limites e alertar o usuário, enquanto o Cost Explorer é mais para análise e visualização."
  },
  {
    "id": "aws-040",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual pilar do AWS Well-Architected Framework foca na capacidade de um sistema se recuperar de interrupções de serviço ou infraestrutura?",
    "options": [
      {
        "id": "a",
        "text": "Eficiência de Performance: Foca em usar recursos computacionais de forma eficiente."
      },
      {
        "id": "b",
        "text": "Confiabilidade (Reliability): Foca na recuperação e continuidade operacional."
      },
      {
        "id": "c",
        "text": "Excelência Operacional: Foca em rodar e monitorar sistemas."
      },
      {
        "id": "d",
        "text": "Otimização de Custos: Foca em evitar gastos desnecessários."
      }
    ],
    "correctOptionId": "b",
    "explanation": "A Confiabilidade garante que o sistema suporte falhas e se recupere automaticamente para atender à demanda."
  },
  {
    "id": "aws-041",
    "certification": "CLF-C02",
    "topicId": "RDS",
    "text": "Qual serviço de banco de dados da AWS é NoSQL, totalmente gerenciado e oferece performance de milissegundos em qualquer escala?",
    "options": [
      {
        "id": "a",
        "text": "Amazon RDS: Banco de dados relacional (SQL)."
      },
      {
        "id": "b",
        "text": "Amazon DynamoDB: Banco de dados de chave-valor e documentos (NoSQL)."
      },
      {
        "id": "c",
        "text": "Amazon Redshift: Data warehouse para analytics."
      },
      {
        "id": "d",
        "text": "Amazon Aurora: Banco relacional compatível com MySQL/PostgreSQL."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O DynamoDB é o serviço NoSQL principal da AWS, conhecido por sua escalabilidade e baixa latência."
  },
  {
    "id": "aws-042",
    "certification": "CLF-C02",
    "topicId": "VPC",
    "text": "Qual componente da rede AWS atua como um firewall para controlar o tráfego de entrada e saída no nível da INSTÂNCIA?",
    "options": [
      {
        "id": "a",
        "text": "Network ACL (NACL): Firewall no nível da sub-rede (stateless)."
      },
      {
        "id": "b",
        "text": "Security Group: Firewall no nível da instância (stateful)."
      },
      {
        "id": "c",
        "text": "Internet Gateway: Permite comunicação entre a VPC e a internet."
      },
      {
        "id": "d",
        "text": "VPC Peering: Conecta duas VPCs."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Security Groups são aplicados diretamente às instâncias (ENIs) e são stateful, ao contrário das NACLs que operam na sub-rede."
  },
  {
    "id": "aws-043",
    "certification": "CLF-C02",
    "topicId": "IAM",
    "text": "Qual prática recomendada de segurança deve ser aplicada para garantir que usuários tenham apenas as permissões necessárias para realizar suas tarefas?",
    "options": [
      {
        "id": "a",
        "text": "Uso da conta Root para tarefas diárias: Não recomendado por ser inseguro."
      },
      {
        "id": "b",
        "text": "Princípio do Menor Privilégio (Least Privilege): Conceder apenas o mínimo de acesso necessário."
      },
      {
        "id": "c",
        "text": "Compartilhamento de chaves de acesso: Prática insegura."
      },
      {
        "id": "d",
        "text": "Desativação do MFA para administradores: Prática insegura."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Princípio do Menor Privilégio é fundamental para reduzir o raio de alcance de possíveis incidentes de segurança."
  },
  {
    "id": "aws-044",
    "certification": "CLF-C02",
    "topicId": "EC2",
    "text": "Uma empresa deseja migrar um servidor web local para a AWS. Qual serviço de computação fornece instâncias virtuais que dão controle total sobre o sistema operacional?",
    "options": [
      {
        "id": "a",
        "text": "AWS Lambda: Serverless, sem controle de SO."
      },
      {
        "id": "b",
        "text": "Amazon EC2: Fornece máquinas virtuais com controle total."
      },
      {
        "id": "c",
        "text": "AWS Elastic Beanstalk: PaaS para deploy de aplicações."
      },
      {
        "id": "d",
        "text": "Amazon Lightsail: Instâncias virtuais pré-configuradas e simplificadas."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O EC2 (Elastic Compute Cloud) é o serviço de IaaS que oferece o nível mais granular de controle sobre a infraestrutura."
  },
  {
    "id": "aws-045",
    "certification": "CLF-C02",
    "topicId": "S3",
    "text": "Qual serviço de armazenamento é ideal para ser usado como um sistema de arquivos compartilhado, acessível por milhares de instâncias EC2 simultaneamente?",
    "options": [
      {
        "id": "a",
        "text": "Amazon EBS: Bloqueio de armazenamento para uma única instância (geralmente)."
      },
      {
        "id": "b",
        "text": "Amazon EFS: Sistema de arquivos elástico e compartilhado via rede (NFS)."
      },
      {
        "id": "c",
        "text": "Amazon S3: Armazenamento de objetos, não um sistema de arquivos tradicional."
      },
      {
        "id": "d",
        "text": "Amazon Instance Store: Armazenamento temporário fisicamente ligado ao host."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O EFS (Elastic File System) é projetado para suportar acesso compartilhado de milhares de instâncias usando o protocolo NFS."
  },
  {
    "id": "aws-046",
    "certification": "CLF-C02",
    "topicId": "BILLING_TOOLS",
    "text": "Qual plano de suporte da AWS inclui o acesso a um Technical Account Manager (TAM) dedicado?",
    "options": [
      {
        "id": "a",
        "text": "Developer Support: Focado em testes e desenvolvimento."
      },
      {
        "id": "b",
        "text": "Business Support: Focado em cargas de trabalho de produção."
      },
      {
        "id": "c",
        "text": "Enterprise Support: O nível mais alto, inclui TAM e concierges."
      },
      {
        "id": "d",
        "text": "Basic Support: Incluído para todos os clientes, sem TAM."
      }
    ],
    "correctOptionId": "c",
    "explanation": "O TAM está disponível apenas no nível Enterprise, oferecendo orientação técnica e operacional personalizada."
  },
  {
    "id": "aws-047",
    "certification": "CLF-C02",
    "topicId": "WELL_ARCHITECTED",
    "text": "Qual serviço da AWS ajuda a automatizar a governança em ambientes multiplex (com centenas de contas), permitindo controle centralizado e faturamento consolidado?",
    "options": [
      {
        "id": "a",
        "text": "AWS CloudTrail: Logs de API."
      },
      {
        "id": "b",
        "text": "AWS Organizations: Gerenciamento centralizado de múltiplas contas AWS."
      },
      {
        "id": "c",
        "text": "AWS Config: Monitora configurações de recursos."
      },
      {
        "id": "d",
        "text": "AWS Systems Manager: Gerenciamento operacional de instâncias."
      }
    ],
    "correctOptionId": "b",
    "explanation": "AWS Organizations permite agrupar contas em UOs (Unidades Organizacionais), aplicar políticas (SCPs) e consolidar o faturamento."
  },
  {
    "id": "aws-048",
    "certification": "CLF-C02",
    "topicId": "SECURITY_GROUPS",
    "text": "Qual serviço AWS é usado para detectar atividades maliciosas ou comportamento não autorizado, protegendo contas e cargas de trabalho usando machine learning?",
    "options": [
      {
        "id": "a",
        "text": "Amazon Inspector: Varredura de vulnerabilidades em instâncias EC2."
      },
      {
        "id": "b",
        "text": "Amazon GuardDuty: Serviço de detecção de ameaças inteligente e contínuo."
      },
      {
        "id": "c",
        "text": "AWS WAF: Firewall de aplicação web contra exploits comuns."
      },
      {
        "id": "d",
        "text": "AWS Shield: Proteção contra ataques DDoS."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O GuardDuty analisa logs (VPC Flow Logs, CloudTrail, DNS) para identificar comportamentos suspeitos como mineração de cripto ou exfiltração de dados."
  },
  {
    "id": "aws-049",
    "certification": "CLF-C02",
    "topicId": "VPC",
    "text": "Qual serviço de DNS da AWS é altamente disponível, escalável e capaz de rotear usuários para endpoints baseados em políticas como geocalização e latência?",
    "options": [
      {
        "id": "a",
        "text": "Amazon CloudFront: Rede de entrega de conteúdo (CDN)."
      },
      {
        "id": "b",
        "text": "Amazon Route 53: Serviço de DNS autoritativo e registro de domínios."
      },
      {
        "id": "c",
        "text": "AWS Global Accelerator: Otimiza caminhos de rede usando a infraestrutura global da AWS."
      },
      {
        "id": "d",
        "text": "VPC PrivateLink: Conecta serviços de forma privada."
      }
    ],
    "correctOptionId": "b",
    "explanation": "O Route 53 é o serviço de DNS da AWS que oferece roteamento avançado para melhorar a experiência do usuário global."
  },
  {
    "id": "aws-050",
    "certification": "CLF-C02",
    "topicId": "RDS",
    "text": "Uma empresa precisa de um banco de dados relacional que scale automaticamente a capacidade de processamento conforme a demanda (serverless). Qual opção é a mais adequada?",
    "options": [
      {
        "id": "a",
        "text": "Amazon RDS (Instância Fixa): Requer escolha de tamanho de instância."
      },
      {
        "id": "b",
        "text": "Amazon Aurora Serverless: Escala automaticamente a capacidade de computação."
      },
      {
        "id": "c",
        "text": "Amazon Redshift: Focado em OLAP/Analytics, não transacional dinâmico."
      },
      {
        "id": "d",
        "text": "Amazon ElastiCache: Cache em memória."
      }
    ],
    "correctOptionId": "b",
    "explanation": "Aurora Serverless é ideal para aplicações com tráfego variável, pois ajusta os recursos de CPU e memória sem intervenção manual."
  }
]